{
  "_name_or_path": "candy_detector_yolo",
  "architectures": [
    "YolosForObjectDetection"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_loss": false,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 192,
  "id2label": {
    "0": "Unicorn_whole",
    "1": "Black_star",
    "2": "Cat",
    "3": "Grey_star",
    "4": "Insect",
    "5": "Moon",
    "6": "Owl",
    "7": "Unicorn_head"
  },
  "image_size": [
    800,
    1333
  ],
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "label2id": {
    "Black_star": 1,
    "Cat": 2,
    "Grey_star": 3,
    "Insect": 4,
    "Moon": 5,
    "Owl": 6,
    "Unicorn_head": 7,
    "Unicorn_whole": 0
  },
  "layer_norm_eps": 1e-12,
  "model_type": "yolos",
  "num_attention_heads": 3,
  "num_channels": 3,
  "num_detection_tokens": 100,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0.dev0",
  "use_mid_position_embeddings": false
}
